/* In browser window title */
"Get a donation key!" = "Get a donation key!";

/* The full name of the supporter */
"Registered to {0}" = "Licențiat pentru {0}";

/* Cyberduck is open source software */
"Thanks for your support! Your contribution helps to further advance development to make Cyberduck even better." = "Mulțumesc pentru suport! Donația ta va contribui la dezvoltarea continua a Cyberduck pentru a-l face cât mai bun.";

/* Copy of donation key */
"Your donation key has been copied to the Application Support folder." = "Cheia ta pentru donație a fost copiata in dosarul Application Support.";

/* Validation failed */
"Not a valid donation key" = "Cheie de donație invalidă";

"This donation key does not appear to be valid." = "Această cheie de donație nu pare validă.";

/* Thank you */
"Continue" = "Continuă";